app/Controllers/Dashboard.php

SELECT *
FROM `notifikasi`
WHERE `id_user` = '4'
ORDER BY `tanggal` DESC
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'selesai'
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'diproses'
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'ditolak'
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'menunggu'
---
public function index()
{
    // Pastikan user sudah login
    if (!session()->get('id_user')) {
        return redirect()->to('/login');
    }

    $notifModel = new NotifikasiModel();
    $db = \Config\Database::connect();

    $data = [
        // Ambil notif berdasarkan user yang login
        'notif'      => $notifModel->where('id_user', session()->get('id_user'))
                                   ->orderBy('tanggal', 'DESC')
                                   ->findAll(),

        'total_user' => $db->table('users')->countAllResults(),

        // Menggunakan countAllResults agar builder di-reset tiap query
        'selesai'    => $db->table('pengaduan')->where('status', 'selesai')->countAllResults(),
        'diproses'   => $db->table('pengaduan')->where('status', 'diproses')->countAllResults(),
        'ditolak'    => $db->table('pengaduan')->where('status', 'ditolak')->countAllResults(),
        'menunggu'   => $db->table('pengaduan')->where('status', 'menunggu')->countAllResults(),