app/Controllers/Dashboard.php

UPDATE `pengaduan` SET `status_sla` = 'terlambat'
WHERE `deadline` < '2026-04-26 11:57:02'
AND `status` != 'selesai'
UPDATE `pengaduan` SET `status_sla` = 'hampir'
WHERE `deadline` >= '2026-04-26 11:57:02'
AND `deadline` <= '2026-04-27 11:57:02'
UPDATE `pengaduan` SET `status_sla` = 'terlambat'
WHERE `deadline` < '2026-04-22 07:03:52'
AND `status` != 'selesai'
SELECT *
FROM `pengaduan`
WHERE `status_sla` = 'terlambat'
---
    public function index()
    {
        // KEAMANAN: Memastikan hanya user yang sudah login yang bisa mengakses dashboard
        if (!session()->get('id_user')) {
            return redirect()->to('/login');
        }

        // INISIALISASI: Memanggil Model dan Koneksi Database
        $notifModel = new NotifikasiModel();
        $db = \Config\Database::connect();
        $now = date('Y-m-d H:i:s');

        // --- PROSES MONITORING SLA (DEADLINE) ---
        // 1. UPDATE STATUS TERLAMBAT: Jika deadline sudah lewat dan status belum selesai
        $db->table('pengaduan')
            ->set('status_sla', 'terlambat')
            ->where('deadline <', $now)
            ->where('status !=', 'selesai')
            ->update();

        // 2. UPDATE STATUS HAMPIR: Jika deadline tersisa kurang dari 24 jam ke depan
        $db->table('pengaduan')
            ->set('status_sla', 'hampir')
            ->where('deadline >=', $now)
            ->where('deadline <=', date('Y-m-d H:i:s', strtotime('+1 day')))
            ->update();

        // 3. UPDATE STATUS AMAN: Jika deadline masih lebih dari 1 hari ke depan
        $db->table('pengaduan')
            ->set('status_sla', 'aman')
            ->where('deadline >', date('Y-m-d H:i:s', strtotime('+1 day')))
            ->update();

        // --- SISTEM NOTIFIKASI OTOMATIS ---
        // Mengambil daftar pengaduan yang telat untuk dikirimkan notifikasi ke Admin
        $telat = $db->table('pengaduan')
            ->where('status_sla', 'terlambat')
            ->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'selesai'
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'diproses'
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'ditolak'
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `status` = 'menunggu'
---
                                       ->findAll(),

            // Menghitung total user terdaftar
            'total_user' => $db->table('users')->countAllResults(),

            // Menghitung statistik pengaduan berdasarkan status
            'selesai'    => $db->table('pengaduan')->where('status', 'selesai')->countAllResults(),
            'diproses'   => $db->table('pengaduan')->where('status', 'diproses')->countAllResults(),
            'ditolak'    => $db->table('pengaduan')->where('status', 'ditolak')->countAllResults(),
            'menunggu'   => $db->table('pengaduan')->where('status', 'menunggu')->countAllResults(),