app/Controllers/Pengaduan.php

    public function index()
{
    $keyword = $this->request->getGet('keyword');
    $jenis   = $this->request->getGet('jenis');
    $tanggal = $this->request->getGet('tanggal');

    $builder = $this->model
        ->select('pengaduan.*, users.nama, jenis_pelapor.nama_jenis')
        ->join('users', 'users.id_user = pengaduan.id_user')
        ->join('jenis_pelapor', 'jenis_pelapor.id_jenis = pengaduan.id_jenis');

    // 🔐 ROLE FILTER
    if(session()->get('role') == 'pelapor'){
        $builder->where('pengaduan.id_user', session()->get('id_user'));
    }

    // 🔍 SEARCH FILTER
    if($keyword){
        $builder->like('judul', $keyword);
    }

    if($jenis){
        $builder->where('pengaduan.id_jenis', $jenis);
    }

    if($tanggal){
        $builder->where('DATE(tanggal)', $tanggal);
    }

    $data['pengaduan'] = $builder->findAll();

    // ambil jenis pelapor untuk dropdown
    $data['jenis'] = db_connect()->table('jenis_pelapor')->get()->getResultArray();
---
SELECT `pengaduan`.*, `users`.`nama`
FROM `pengaduan`
JOIN `users` ON `users`.`id_user` = `pengaduan`.`id_user`
SELECT `pengaduan`.*, `users`.`nama`, `jenis_pelapor`.`nama_jenis`
FROM `pengaduan`
JOIN `users` ON `users`.`id_user` = `pengaduan`.`id_user`
JOIN `jenis_pelapor` ON `jenis_pelapor`.`id_jenis` = `pengaduan`.`id_jenis`
WHERE `pengaduan`.`id_user` = '4'
SELECT *
FROM `jenis_pelapor`

    public function create()
    {
    // CEK ROLE
    if (session()->get('role') != 'pelapor') {
        return redirect()->to('/pengaduan')->with('error', 'Akses ditolak!');
    }

    $db = db_connect();
    $data['jenis'] = $db->table('jenis_pelapor')->get()->getResultArray();
---
SELECT *
FROM `jenis_pelapor`

    public function delete($id)
{
    // 🔐 hanya admin
    if(session()->get('role') != 'admin'){
        return redirect()->to('/pengaduan')
            ->with('error','Tidak punya akses');
    }

    $data = $this->model->find($id);

    // ❌ JIKA SUDAH SELESAI → TOLAK HAPUS
    if($data['status'] == 'selesai'){
        return redirect()->to('/pengaduan')
            ->with('error','Data yang sudah selesai tidak boleh dihapus');
    }

    // ❗ OPTIONAL: kalau masih ada penugasan
    $cek = db_connect()->table('penugasan')
        ->where('id_pengaduan', $id)
        ->countAllResults();

    if($cek > 0){
        return redirect()->to('/pengaduan')
            ->with('error','Data masih memiliki penugasan');
---
SELECT `pengaduan`.*, `users`.`nama`, `jenis_pelapor`.`nama_jenis`
FROM `pengaduan`
JOIN `users` ON `users`.`id_user` = `pengaduan`.`id_user`
JOIN `jenis_pelapor` ON `jenis_pelapor`.`id_jenis` = `pengaduan`.`id_jenis`
WHERE `id_pengaduan` = '1'
 LIMIT 1

    public function detail($id)
{
    // Ambil pengaduan + relasi
    $data['pengaduan'] = $this->model
        ->select('pengaduan.*, users.nama, jenis_pelapor.nama_jenis')
        ->join('users', 'users.id_user = pengaduan.id_user')
        ->join('jenis_pelapor', 'jenis_pelapor.id_jenis = pengaduan.id_jenis')
        ->where('id_pengaduan', $id)
        ->first();

    // Ambil tanggapan
    $db = db_connect();
    $data['tanggapan'] = $db->table('tanggapan')
        ->select('tanggapan.*, users.nama')
        ->join('users', 'users.id_user = tanggapan.id_user')
        ->where('id_pengaduan', $id)
        ->get()
        ->getResultArray();
---
SELECT `tanggapan`.*, `users`.`nama`
FROM `tanggapan`
JOIN `users` ON `users`.`id_user` = `tanggapan`.`id_user`
WHERE `id_pengaduan` = '22'
SELECT `pengaduan`.*, `users`.`nama`, `jenis_pelapor`.`nama_jenis`
FROM `pengaduan`
JOIN `users` ON `users`.`id_user` = `pengaduan`.`id_user`
LEFT JOIN `jenis_pelapor` ON `jenis_pelapor`.`id_jenis` = `users`.`id_jenis`
WHERE `id_pengaduan` = '22'
 LIMIT 1

public function tolak($id)
{
    // 🔥 ambil alasan dari form
    $alasan = $this->request->getPost('alasan');

    // update pengaduan
    $this->model->update($id, [
        'status' => 'ditolak',
        'alasan_ditolak' => $alasan
    ]);

    // ambil data pengaduan
    $pengaduan = db_connect()->table('pengaduan')
        ->where('id_pengaduan', $id)
        ->get()->getRowArray();

    // 🔔 kirim notifikasi
    $alasan = $this->request->getPost('alasan');

db_connect()->table('notifikasi')->insert([
    'id_user' => $pengaduan['id_user'],
    'pesan' => 'Pengaduan ditolak: '.$alasan,
    'status' => 'belum'
]);
---
SELECT *
FROM `pengaduan`
WHERE `id_pengaduan` = '33'
INSERT INTO `notifikasi` (`id_user`, `pesan`, `status`) VALUES ('9', 'Pengaduan ditolak: dss', 'belum')