app/Controllers/Pengaduan.php

SELECT `tanggapan`.*, `users`.`nama`
FROM `tanggapan`
JOIN `users` ON `users`.`id_user` = `tanggapan`.`id_user`
WHERE `id_pengaduan` = '1'
---
    public function detail($id)
{
    // Ambil pengaduan + relasi
    $data['pengaduan'] = $this->model
        ->select('pengaduan.*, users.nama, jenis_pelapor.nama_jenis')
        ->join('users', 'users.id_user = pengaduan.id_user')
        ->join('jenis_pelapor', 'jenis_pelapor.id_jenis = pengaduan.id_jenis')
        ->where('id_pengaduan', $id)
        ->first();

    // Ambil tanggapan
    $db = db_connect();
    $data['tanggapan'] = $db->table('tanggapan')
        ->select('tanggapan.*, users.nama')
        ->join('users', 'users.id_user = tanggapan.id_user')
        ->where('id_pengaduan', $id)
        ->get()
        ->getResultArray();