app/Controllers/Penugasan.php

    public function index()
    {
        $db = db_connect();

        // Mengambil parameter pencarian dari URL
        $pengaduan = $this->request->getGet('pengaduan');
        $teknisi   = $this->request->getGet('teknisi');
        $tanggal   = $this->request->getGet('tanggal');

        // Membangun query dengan join ke tabel pengaduan dan users
        $builder = $this->model
            ->select('penugasan.*, pengaduan.judul, users.nama')
            ->join('pengaduan', 'pengaduan.id_pengaduan = penugasan.id_pengaduan')
            ->join('users', 'users.id_user = penugasan.id_teknisi');

        // Filter Role: Jika teknisi, hanya tampilkan tugas yang diberikan kepadanya
        if(session()->get('role') == 'teknisi'){
---
SELECT `penugasan`.*, `pengaduan`.`judul`, `users`.`nama`
FROM `penugasan`
JOIN `pengaduan` ON `pengaduan`.`id_pengaduan` = `penugasan`.`id_pengaduan`
JOIN `users` ON `users`.`id_user` = `penugasan`.`id_teknisi`

        $data['penugasan'] = $builder->findAll();

        // Mengambil daftar teknisi untuk dropdown filter
        $data['teknisiList'] = $db->table('users')
            ->where('role','teknisi')
            ->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `role` = 'teknisi'