app/Controllers/Support.php

    public function index()
{
    $role = session()->get('role');
    $id_user = session()->get('id_user');

    if ($role == 'admin') {
        // Admin melihat semua tiket
        $data['ticket'] = $this->model->orderBy('id_support','DESC')->findAll();
    } else {
        // Pelapor hanya melihat tiket miliknya sendiri
        $data['ticket'] = $this->model->where('id_user', $id_user)
                                      ->orderBy('id_support','DESC')
                                      ->findAll();
---
SELECT *
FROM `support`
WHERE `id_user` = '4'
ORDER BY `id_support` DESC