app/Controllers/Tanggapan.php

    public function index()
    {
        // Mengambil parameter pencarian dari query string
        $keyword = $this->request->getGet('keyword');
        $tanggal = $this->request->getGet('tanggal');

        // Membangun query dengan join ke tabel pengaduan dan users
        $builder = $this->model
            ->select('tanggapan.*, pengaduan.judul, users.nama')
            ->join('pengaduan', 'pengaduan.id_pengaduan = tanggapan.id_pengaduan')
            ->join('users', 'users.id_user = tanggapan.id_user');

        // Logika Filter: Berdasarkan isi tanggapan atau judul pengaduan
        if($keyword){
            $builder->like('isi_tanggapan', $keyword)
                    ->orLike('pengaduan.judul', $keyword);
        }

        // Logika Filter: Berdasarkan tanggal tanggapan diberikan
        if($tanggal){
            $builder->where('DATE(tanggapan.tanggal)', $tanggal);
        }

        $data['tanggapan'] = $builder->findAll();
---
SELECT `tanggapan`.*, `pengaduan`.`judul`, `users`.`nama`
FROM `tanggapan`
JOIN `pengaduan` ON `pengaduan`.`id_pengaduan` = `tanggapan`.`id_pengaduan`
JOIN `users` ON `users`.`id_user` = `tanggapan`.`id_user`