app/Views/layouts/dashboard.php


    <?php
    $notifModel = new \App\Models\NotifikasiModel();
    $notif = $notifModel
        ->where('id_user', session()->get('id_user'))
        ->orderBy('tanggal','DESC')
        ->findAll();
---
SELECT *
FROM `notifikasi`
WHERE `id_user` = '1'
ORDER BY `tanggal` DESC